{
  "backend/main.mo": "Main Motoko actor implementing a game store with user profiles, game catalog (CRUD operations), role-based access control (admin/user permissions), and blob storage for game images.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and configuration for the Dragon Games Store application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color schemes, borders, and sidebar styling.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Dragon Games Store application.",
  "frontend/src/App.tsx": "Root application component using TanStack Router to define routes for home page and admin panel with shared header/footer layout.",
  "frontend/src/components/AboutUs.tsx": "About section component displaying store description, platform availability (PC, PS4, PS5, Xbox), customer statistics (5,600+ customers, 3 years experience), and value propositions with icons.",
  "frontend/src/components/AdminGameForm.tsx": "Modal form component for adding/editing games with fields for name, price, platform, description, image upload with progress tracking, trailer URL, and sale status toggle.",
  "frontend/src/components/AdminGameList.tsx": "Admin game management component displaying all games in a grid with edit/delete actions and confirmation dialog for deletions.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice and Caffeine.ai attribution link with UTM tracking parameters.",
  "frontend/src/components/GameCard.tsx": "Displays a game card with image/video trailer, price, platform badge, description, and action buttons (Buy Now via WhatsApp, admin edit/delete). Supports toggling between image and embedded video trailer on click.",
  "frontend/src/components/GameCatalog.tsx": "Renders a searchable catalog of games in horizontal scrollable rows of 4 cards each. Includes loading/error states and search filtering by game name.",
  "frontend/src/components/Header.tsx": "Site header with logo, title, login/logout button, and conditional admin panel link. Uses Internet Identity for authentication and displays user role-based UI.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that checks authentication and admin role, displaying appropriate login prompts or access denied messages for non-admin users.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog for first-time user profile setup, prompting authenticated users to enter their name. Cannot be dismissed until completed.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with Internet Identity authentication, initializes access control with admin token, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useAuth.ts": "Provides React Query hooks for user authentication operations: fetching caller role, checking admin status, and getting/saving user profiles.",
  "frontend/src/hooks/useGames.ts": "Provides React Query hooks for game CRUD operations: fetching all games, filtering by platform/sale status, and adding/updating/deleting games with cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining color schemes (white/black theme with blue primary), and custom scrollbar styling.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminPage.tsx": "Protected admin panel page displaying game catalog management with add/edit functionality through AdminGameList and AdminGameForm components.",
  "frontend/src/pages/HomePage.tsx": "Main landing page showing AboutUs section, GameCatalog, and conditionally displays UserProfileSetup dialog for authenticated users without profiles.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom OKLCH color system, container settings, animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata tracking Dragon Games Store deployment request (AR-1) to deploy Draft Version 4 with larger GameCard images and click-to-play video trailers to ICP mainnet."
}