{
  "backend/main.mo": "Main Motoko actor defining user profiles, game catalog with CRUD operations, platform types (PC, PS4, PS5, Xbox), and role-based access control using mixins for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: replacing platform emoji icons with actual logo images in GameCard.tsx and adding white navigation arrows to horizontally scrollable game rows in GameCatalog.tsx.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, pages, hooks, and configuration for the Dragon Games Store application with authentication, game catalog, and admin functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space for consistent styling across the application.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Dragon Games Store React application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home page and admin panel, wrapped in a layout with Header, Footer, and main content area.",
  "frontend/src/components/AboutUs.tsx": "About section component displaying Dragon Games Store description, platform availability (PC, PS4, PS5, Xbox) with icons, customer statistics, and value propositions with Lucide icons.",
  "frontend/src/components/AdminGameForm.tsx": "Dialog form component for adding/editing games with fields for name, price, platform selection, description, image upload with progress tracking, trailer URL, and sale status toggle.",
  "frontend/src/components/AdminGameList.tsx": "Admin game management component displaying all games in a grid with edit/delete actions and confirmation dialog for deletions, using GameCard and AdminGameForm components.",
  "frontend/src/components/Footer.tsx": "Renders a footer component displaying copyright information and a referral link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/GameCard.tsx": "Displays a game card with image, price, platform badges, and action buttons; includes modal dialogs for game details and trailer video playback, plus admin edit/delete controls.",
  "frontend/src/components/GameCatalog.tsx": "Renders a searchable game catalog with horizontal scrolling rows of game cards (4 per row), featuring left/right navigation arrows and loading/error states.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, Steam/WhatsApp icons, login/logout button, and conditional admin panel access button based on user role.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that checks authentication and admin role, displaying appropriate login or access denied messages if requirements aren't met.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog for first-time user profile setup, prompting authenticated users to enter their name before continuing.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with Internet Identity authentication, handling actor creation and query invalidation on identity changes.",
  "frontend/src/hooks/useAuth.ts": "Provides React Query hooks for user authentication operations including role checking, admin verification, and profile management (get/save).",
  "frontend/src/hooks/useGames.ts": "Provides React Query hooks for game CRUD operations including fetching all games, filtering by platform/sale status, and add/update/delete mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using OKLCH color space, plus custom scrollbar styling and Inter font family.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Protected admin page component displaying game management interface with add/edit functionality and game list.",
  "frontend/src/pages/HomePage.tsx": "Main homepage component that displays AboutUs section, GameCatalog, and conditionally shows UserProfileSetup dialog for authenticated users without profiles.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom OKLCH color system, container settings, animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata tracking feature requests to replace platform emoji icons with actual logos and add navigation arrows to horizontally scrollable game rows."
}