{
  "backend/main.mo": "Main backend actor implementing user profile management (with caller-based access control) and game catalog CRUD operations (admin-only mutations, public queries) using access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting a completed feature to modify GameCard price display to medium sizing (text-xl) in the top right corner below the sale label.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and configuration with details about styling, routing, authentication, and game management functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space for backgrounds, foregrounds, borders, and component variants.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'Dragon Games Store' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with root layout (Header/Footer/Outlet), home page route ('/'), and admin page route ('/admin').",
  "frontend/src/components/AboutUs.tsx": "About section component displaying Dragon Games Store description, platform availability (PC, PS4, PS5, Xbox), customer statistics (5,600+ customers, 3 years experience), and value propositions with icons.",
  "frontend/src/components/AdminGameForm.tsx": "Dialog form component for adding/editing games with fields for name, price, platform selection, description, image upload with progress tracking, trailer URL, and sale toggle; handles image upload and mutation submission.",
  "frontend/src/components/AdminGameList.tsx": "Admin game list component displaying all games in a grid with edit/delete actions, integrating AdminGameForm dialog and AlertDialog for delete confirmation.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice with current year and Caffeine.ai attribution link with UTM tracking parameters based on hostname.",
  "frontend/src/components/GameCard.tsx": "Displays a game card with image, price, platform badge, sale indicator, and admin controls (edit/delete). Includes a detail dialog with trailer video playback and WhatsApp buy button.",
  "frontend/src/components/GameCatalog.tsx": "Renders a searchable game catalog with horizontal scrollable rows of 4 games each, featuring left/right navigation arrows and loading/error states.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, Steam/WhatsApp icons, login/logout button, and conditional admin panel access button based on user role.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that checks authentication and admin role, displaying appropriate login or access denied messages when requirements aren't met.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog for first-time user profile setup, prompting authenticated users to enter their name before accessing the application.",
  "frontend/src/hooks/useActor.ts": "Manages backend actor creation with Internet Identity authentication, initializes access control with admin token, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useAuth.ts": "Provides React Query hooks for user authentication operations including role checking, admin verification, and user profile retrieval/saving.",
  "frontend/src/hooks/useGames.ts": "Provides React Query hooks for all game CRUD operations including fetching all games, filtering by platform/sale status, and add/update/delete mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with AuthClient integration.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining color schemes (white/black base with blue primary), scrollbar styling, and design tokens.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminPage.tsx": "Protected admin panel page for managing game catalog with add/edit functionality, displaying AdminGameList and AdminGameForm components.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying AboutUs section, GameCatalog, and conditionally showing UserProfileSetup dialog for authenticated users without profiles.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom colors using OKLCH color space, container settings, animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata for Dragon Games Store e-commerce platform, documenting architectural decisions like WhatsApp contact, horizontal scrolling navigation, and game card layout specifications."
}