{
  "backend/main.mo": "Main backend actor implementing user profile management, game catalog CRUD operations with admin/user role-based access control, and blob storage for game images.",
  "feature_evidence.json": "Feature evidence report documenting two features: increasing GameCard image size (REQ-1) and changing video trailer to click-to-play behavior (REQ-2).",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and configuration files with implementation details.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color schemes and design tokens for the application.",
  "frontend/index.html": "HTML entry point with Dragon Games Store title and root div for React application mounting.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home page and admin panel, wrapped in a layout with header and footer.",
  "frontend/src/components/AboutUs.tsx": "Marketing section component displaying Dragon Games Store description, platform availability icons, customer statistics, and value propositions with Lucide icons.",
  "frontend/src/components/AdminGameForm.tsx": "Dialog form component for adding/editing games with fields for all game properties, image upload with progress tracking, and platform selection using shadcn/ui components.",
  "frontend/src/components/AdminGameList.tsx": "Admin game management component displaying all games in a grid with edit/delete actions and confirmation dialog for deletions.",
  "frontend/src/components/Footer.tsx": "Renders a footer component displaying copyright information and a link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/GameCard.tsx": "Displays a game card with image/video trailer, price, platform badge, description, and action buttons for buying via WhatsApp or admin edit/delete operations.",
  "frontend/src/components/GameCatalog.tsx": "Renders a searchable game catalog with horizontal scrollable rows of game cards, displaying loading/error states and filtering games by search query.",
  "frontend/src/components/Header.tsx": "Displays the site header with logo, navigation, login/logout button, and conditional admin panel access button based on user role.",
  "frontend/src/components/ProtectedRoute.tsx": "Wraps child components with authentication and admin role checks, showing appropriate login or access denied messages when requirements aren't met.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog that prompts authenticated users to enter their name for profile setup, preventing dismissal until completed.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance creation with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAuth.ts": "Provides React Query hooks for fetching and saving user authentication data including role, admin status, and user profile.",
  "frontend/src/hooks/useGames.ts": "Provides React Query hooks for CRUD operations on games including fetching all games, filtering by platform/sale status, and add/update/delete mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with AuthClient integration.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space, plus custom scrollbar styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Protected admin page component that displays game management interface with add/edit functionality through AdminGameList and AdminGameForm components.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that displays AboutUs and GameCatalog sections, conditionally showing UserProfileSetup dialog for authenticated users without profiles.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both standard query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind configuration defining custom color scheme using OKLCH variables, container settings, animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata tracking existing features for GameCard image sizing and video trailer click behavior, with one pending feature request to combine both changes."
}