{
  "backend/main.mo": "Main backend actor implementing user profile management (get/save), game catalog CRUD operations with admin-only add/update/delete, public queries for games by platform/sale status, and access control using mixins for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: updating WhatsApp contact number to 918757242995 in GameCard.tsx and adding a real-time search bar with icon in GameCatalog.tsx.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, pages, hooks, and configuration for the Dragon Games Store application with white/black/blue theme.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space, including sidebar, chart, and UI component color tokens.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'Dragon Games Store' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component using TanStack Router to define routes for home page (/) and admin page (/admin) with shared Header/Footer layout wrapper.",
  "frontend/src/components/AboutUs.tsx": "About section component displaying Dragon Games Store description, 3 years experience, 5,600+ customers, platform availability (PC/PS5/PS4/Xbox), and value propositions with Lucide icons.",
  "frontend/src/components/AdminGameForm.tsx": "Dialog form component for adding/editing games with fields for name, price, platform, description, image upload with progress tracking, trailer URL, and sale status toggle using shadcn/ui components.",
  "frontend/src/components/AdminGameList.tsx": "Admin game management component displaying all games in a grid with edit/delete actions, using AdminGameForm dialog for editing and AlertDialog for delete confirmation.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice with current year and 'Built with caffeine.ai' attribution link with UTM tracking parameters.",
  "frontend/src/components/GameCard.tsx": "Displays a game card with image, price, platform badge, description, optional trailer video, and action buttons (Buy Now via WhatsApp for users, Edit/Delete for admins).",
  "frontend/src/components/GameCatalog.tsx": "Renders a searchable catalog of games in horizontal scrollable rows of 4 cards each, with loading and error states.",
  "frontend/src/components/Header.tsx": "Site header with logo, navigation, login/logout button, and conditional Admin Panel button for admin users.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that checks authentication and admin role, displaying appropriate messages or rendering children if authorized.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog that prompts authenticated users to enter their name for profile setup, preventing dismissal until completed.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAuth.ts": "Provides React Query hooks for user authentication operations: fetching caller role, admin status, and user profile, plus saving profile.",
  "frontend/src/hooks/useGames.ts": "Provides React Query hooks for game CRUD operations: fetching all games, by ID, by platform, on-sale games, and mutations for add/update/delete.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using white background with black text, blue primary colors, and custom scrollbar styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Protected admin panel page with header, add game button, and components for listing and managing the game catalog.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying AboutUs and GameCatalog components, with conditional UserProfileSetup dialog for authenticated users without profiles.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom OKLCH color system, container settings, animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata describing Dragon Games Store as a digital gaming marketplace with white/black theme, WhatsApp purchase flow, and existing features for game catalog, admin interface, and search functionality."
}