{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace platform emojis with logos and add slide navigation arrows",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace all platform emoji icons with actual logo images for Steam, Xbox, and PlayStation platforms",
      "acceptanceCriteria": [
        "Platform badges on game cards display actual logo images instead of text emojis",
        "Steam logo appears for PC platform games",
        "Xbox logo appears for Xbox platform games",
        "PlayStation logo appears for PS4 and PS5 platform games",
        "Logo images are properly sized and styled to match the existing badge design"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GameCard.tsx",
          "operation": "modify",
          "description": "Replace platform emoji rendering with image logo rendering. Import the generated platform logo images from frontend/public/assets/generated/steam-logo.dim_64x64.png, frontend/public/assets/generated/xbox-logo.dim_64x64.png, and frontend/public/assets/generated/playstation-logo.dim_64x64.png. Update the platform badge rendering logic to display <img> elements with the appropriate logo based on the game's platform value (pc → steam-logo, xbox → xbox-logo, ps4/ps5 → playstation-logo). Ensure images are sized appropriately (e.g., 16x16 or 20x20 pixels) and maintain the existing badge styling with proper spacing and alignment."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add white navigation arrows to horizontally scrollable game rows to guide users on sliding through games",
      "acceptanceCriteria": [
        "White arrow buttons appear on both left and right sides of each game row",
        "Arrows are positioned to clearly indicate horizontal scrolling capability",
        "Left arrow is hidden or disabled when at the start of a row",
        "Right arrow is hidden or disabled when at the end of a row",
        "Clicking arrows smoothly scrolls the game row horizontally"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GameCatalog.tsx",
          "operation": "modify",
          "description": "Add horizontal scroll navigation arrows to each game row. For each horizontally scrollable row of game cards, add left and right arrow buttons positioned absolutely on the left and right edges. Implement scroll state tracking using React refs and state to detect when the user is at the start or end of each row. Hide or disable the left arrow when scrolled to the start position and the right arrow when scrolled to the end. Add onClick handlers to smoothly scroll the row by one card width (or a fixed amount) using scrollBy or smooth scroll behavior. Style arrows as white (or outlined white) to match the application's color scheme, with hover states for better UX. Ensure arrows are clearly visible against the content and positioned to avoid obscuring game cards."
        }
      ]
    }
  ]
}